Tekla Open API Reference for Tekla Structures 2025
SymbolLibrary Methods
Methods
Name | Description
GetSymbolLibraries()
 Gets the names of the available symbol files in the current Tekla Structures environment, in the "symbols" directory, without the suffix.
GetSymbolLibraries(Boolean)
 Gets the names of the available symbol files in the current Tekla Structures environment, in the "symbols" directory, without the suffix.
Top
See Also
Reference
SymbolLibrary Class
Tekla.Structures.Drawing Namespace